# -*- coding: utf-8 -*-
# @Time    : 2024/4/18 18:16
# @Author  : Stepstar
# @FileName: format_config.py
# @Software: PyCharm
# -*- coding: utf-8 -*-
# @Time    : 2024/4/7 21:30
# @Author  : Stepstar
# @FileName: format_config.py
# @Software: PyCharm
# TODO：在实际撰写word过程中，段前间距一般是选择类似于一行两行，而非具体数值，但win32提取的是具体数值，需要做一个映射，这样提示错误可以让工作人员更好更改
title_format = {
    '标题 1':
        {"字体":'黑体',
            "字体大小":10.5,
            "加粗":0,
            "斜体":0,
            "下划线:":0,
            "左缩进:": 0,
            "右缩进:": 0,
            "首行缩进:":0,
            "段前间距:": 15.600000381469727,
            "段后间距:": 15.600000381469727,
            "行距:": 12,
            "水平对齐方式:": 0},
    '标题 2':{
            "字体":'黑体',
            "字体大小":10.5,
            "加粗":0,
            "斜体":0,
            "下划线:":0,
            "左缩进:": 0,
            "右缩进:": 0,
            "首行缩进:":0,
            "段前间距:":  7.800000190734863,
            "段后间距:": 7.800000190734863,
            "行距:": 12,
            "水平对齐方式:": 0
    },
    '标题 3':{
            "字体":'黑体',
            "字体大小":10.5,
            "加粗":0,
            "斜体":0,
            "下划线:":0,
            "左缩进:": 0,
            "右缩进:": 0,
            "首行缩进:":0,
            "段前间距:":  0,
            "段后间距:":0,
            "行距:": 15,
            "水平对齐方式:": 0
    }
}
# reference_format是自己定义的，航发给的文件缺失
reference_format = {
            "字体":'黑体',
            "字体大小":12,
            "加粗":0,
            "斜体":0,
            "下划线:":0,
            "左缩进:": 0,
            "右缩进:": 0,
            "首行缩进:":0,
            "段前间距:": 42.540000915527344,
            "段后间距:": 14.1899995803833,
            "行距:": 12,
            "水平对齐方式:": 1
}
